zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_siul2.h
/* Typedef for interrupt callback. */
typedef void (*siul2_cb_t)(SIUL2_Type *base, uint32_t status);
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Initialize pin.
 *
 * @param config the pin's setting @ref siul2_pin_settings_t.
 */
void SIUL2_PinInit(const siul2_pin_settings_t *config);

/*!
 * @brief Set the pin Input Buffer.
 *
 * @param base SIUL2 peripheral base pointer
 * @param pin pin number, 0, 1...511, see RM for available pins
 * @param enable Enable input buffer
 * @param inputMuxReg Pin muxing register slot selection
 * @param inputMux Pin muxing slot selection
 */
void SIUL2_SetPinInputBuffer(
    SIUL2_Type *base, uint32_t pin, bool enable, uint32_t inputMuxReg, siul2_port_inputmux_t inputMux);

/*!
 * @brief Set the pin Output Buffer.
 *
 * @param base SIUL2 peripheral base pointer
 * @param pin pin number, 0, 1...511, see RM for available pins
 * @param enable Enable output buffer
 * @param mux Pin muxing slot selection
 */
void SIUL2_SetPinOutputBuffer(SIUL2_Type *base, uint32_t pin, bool enable, siul2_port_mux_t mux);

/*!
 * @brief Configures the pin pull select.
 *
 * This function configures the internal resistor.
 *
 * @param base SIUL2 peripheral base pointer
 * @param pin pin number, 0, 1...511, see RM for available pins
 * @param pullConfig The pull configuration
 */
void SIUL2_SetPinPullSel(SIUL2_Type *base, uint32_t pin, siul2_port_pull_config_t pullConfig);

/*!
 * @brief Set the pin direction.
 *
 * @param base SIUL2 peripheral base pointer
 * @param pin pin number, 0, 1...511, see RM for available pins.
 * @param direction pin direction.
 */
void SIUL2_SetPinDirection(SIUL2_Type *base, uint32_t pin, siul2_port_direction_t direction);

/*!
 * @brief Sets the output level of the multiple GPIO pins to the logic 1.
 *
 * @param base SIUL2 peripheral base pointer
 * @param port GPIO PORT number, see "siul2_port_num_t".
 * @param pins ORed GPIO pins in a port.
 */
void SIUL2_PortSet(SIUL2_Type *base, siul2_port_num_t port, uint32_t pins);

/*!
 * @brief Sets the output level of the multiple GPIO pins to the logic 1.
 *
 * @param base SIUL2 peripheral base pointer
 * @param port GPIO PORT number, see "siul2_port_num_t".
 * @param pins GPIO pins to be configured.
 * @param mask ORed bits of which pins will be masked.
 */
void SIUL2_PortMaskWrite(SIUL2_Type *base, siul2_port_num_t port, uint32_t pins, uint32_t mask);

/*!
 * @brief Sets the output level of the multiple GPIO pins to the logic 0.
 *
 * @param base SIUL2 peripheral base pointer
 * @param port GPIO PORT number, see "siul2_port_num_t".
 * @param pins GPIO pin number macro
 */
void SIUL2_PortClear(SIUL2_Type *base, siul2_port_num_t port, uint32_t pins);

/*!
 * @brief Toggle the output level of the multiple GPIO pins.
 *
 * @param base SIUL2 peripheral base pointer
 * @param port GPIO PORT number, see "siul2_port_num_t".
 * @param pins GPIO pin number macro
 */
void SIUL2_PortToggle(SIUL2_Type *base, siul2_port_num_t port, uint32_t pins);

/*!
 * @brief Set the pin output.
 *
 * @param base SIUL2 peripheral base pointer
 * @param port GPIO PORT number, see "siul2_port_num_t".
 * @param pin GPIO pin number
 * @param output Output value, 0 or 1.
 */
static inline void SIUL2_PortPinWrite(SIUL2_Type *base, siul2_port_num_t port, uint32_t pin, uint8_t output)
{
    assert(pin < 32U); /* Check pin number is valid. */

    uint32_t pinIndex = (uint32_t)port * 32U + pin;

    SIUL2_PORT_WRITE8(SIUL2_GPDO_ADDR(base, pinIndex), output);
}

/*!
 * @brief Get the pin input.
 *
 * @param base SIUL2 peripheral base pointer
 * @param port GPIO PORT number, see "siul2_port_num_t".
 * @param pin GPIO pin number
 */
inline static uint32_t SIUL2_PortPinRead(SIUL2_Type *base, siul2_port_num_t port, uint8_t pin)
{
    assert(pin < 32U); /* Check pin number is valid. */

    uint32_t pinIndex = (uint32_t)port * 32U + pin;
    return SIUL2_PORT_READ8(SIUL2_GPDI_ADDR(base, pinIndex));
}

/*!
 * @brief Set the pin output.
 *
 * @param base SIUL2 peripheral base pointer
 * @param pin GPIO pin number
 * @param output Output value, 0 or 1.
 */
static inline void SIUL2_PinWrite(SIUL2_Type *base, uint32_t pin, uint8_t output)
{
    SIUL2_PORT_WRITE8(SIUL2_GPDO_ADDR(base, pin), output);
}

/*!
 * @brief Get the pin input.
 *
 * @param base SIUL2 peripheral base pointer
 * @param pin GPIO pin number
 */
inline static uint32_t SIUL2_PinRead(SIUL2_Type *base, uint8_t pin)
{
    return SIUL2_PORT_READ8(SIUL2_GPDI_ADDR(base, pin));
}

/*!
 * @brief Set the Glitch filter prescaler.
 *
 * @param base SIUL2 peripheral base pointer
 * @param div Glitch filter prescaler 0...15. Prescaled Filter Clock period is internal oscillator period x (div + 1).
 */
inline static void SIUL2_SetGlitchFilterPrescaler(SIUL2_Type *base, uint8_t div)
{
    base->IFCPR = SIUL2_IFCPR_IFCP(div);
}

/*!
 * @brief Set Glitch filter max count.
 *
 * @param base SIUL2 peripheral base pointer
 * @param req which interrupt/DMA request to set, 0...31
 * @param filterCount Maximum filter count 0...15, < 0 disable filterCount.
 */
inline static void SIUL2_SetGlitchFilterMaxCount(SIUL2_Type *base, uint32_t req, int8_t filterCount)
{
    if (filterCount >= 0) /* Enable and config filter*/
    {
        base->IFER0 |= 1U << req;
        base->IFMCR[req] = filterCount;
    }
    else
    {
        base->IFER0 &= ~(1U << req);
    }
}

/*!
 * @brief Setup Interupt configuration.
 *
 * @param base SIUL2 peripheral base pointer
 * @param req which interrupt/DMA request to set, 0...31
 * @param config the configuration structure.
 */
void SIUL2_SetDmaInterruptConfig(SIUL2_Type *base, uint32_t req, siul2_interrupt_config_t config);

/*!
 * @brief Enable external interrupt.
 *
 * @param base SIUL2 peripheral base pointer
 * @param req which interrupt request to set, 0...31
 * @param config interrupt configuration, @ref siul2_interrupt_config_t
 * @param filterCount Maximum filter count 0...15, < 0 disable filterCount.
 */
void SIUL2_EnableExtInterrupt(SIUL2_Type *base, uint32_t req, siul2_interrupt_config_t config, int8_t filterCount);

/*!
 * @brief Enable external DMA request.
 *
 * @param base SIUL2 peripheral base pointer
 * @param req which DMA request to set, refer to RM for supported external DMA request number. 
 * @param config interrupt configuration, @ref siul2_interrupt_config_t
 * @param filterCount Maximum filter count 0...15, < 0 disable filterCount.
 */
void SIUL2_EnableExtDma(SIUL2_Type *base, uint32_t req, siul2_interrupt_config_t config, int8_t filterCount);

/*!
 * @brief Disable external DMA and interrupt.
 *
 * @param base SIUL2 peripheral base pointer
 * @param req which interrupt/DMA request to set, 0...31
 */
inline static void SIUL2_DisableExtDmaAndInterrupt(SIUL2_Type *base, uint32_t req)
{
    base->DIRER0 &= ~(1U << req); /* Disable Int/DMA request. */
}

/*!
 * @brief Disable mutliple external DMA and interrupts.
 *
 * @param base SIUL2 peripheral base pointer
 * @param mask bit mask of external DMA or interupt requests
 */
inline static void SIUL2_DisableExtDmaAndInterrupts(SIUL2_Type *base, uint32_t mask)
{
    base->DIRER0 &= ~mask; /* Disable Int/DMA requests. */
}

/*!
 * @brief Enable mutliple external interrupts.
 *
 * @param base SIUL2 peripheral base pointer
 * @param mask bit mask of interrupt requests
 * @param config interrupt configuration, @ref siul2_interrupt_config_t
 * @param filterCount Maximum filter count 0...15, < 0 disable filterCount.
 */
void SIUL2_EnableExtInterrupts(SIUL2_Type *base, uint32_t mask, siul2_interrupt_config_t config, int8_t filterCount);

/*!
 * @brief Enable mutliple external DMA requests.
 *
 * @param base SIUL2 peripheral base pointer
 * @param mask bit mask of DMA requests
 * @param config interrupt configuration, @ref siul2_interrupt_config_t
 * @param filterCount Maximum filter count 0...15, < 0 disable filterCount.
 */
void SIUL2_EnableExtDmaRequests(SIUL2_Type *base, uint32_t mask, siul2_interrupt_config_t config, int8_t filterCount);

/*!
 * @brief Get the external DMA/interrupt status flag.
 *
 * @param base SIUL2 peripheral base pointer
 * @return the status flags
 */
inline static uint32_t SIUL2_GetExtDmaInterruptStatusFlags(SIUL2_Type *base)
{
    return base->DISR0;
}

/*!
 * @brief Clear the external DMA/interrupt status flags.
 *
 * @param base SIUL2 peripheral base pointer
 * @param mask the status flags bit mask
 */
inline static void SIUL2_ClearExtDmaInterruptStatusFlags(SIUL2_Type *base, uint32_t mask)
{
    base->DISR0 |= mask;
}

/*!
 * @brief Get the external interrupt request number for the pin.
 *
 * @param pin GPIO pin number, 0...511, refer to RM for avaiable Pins.
 * @return 0...31 the EIRQ number, > 32 means the pin is not capable for EIRQ.
 */
uint32_t SIUL2_GetPinEirqNumber(uint32_t pin);

/*!
 * @brief Enable EIRQ with callback.
 * This function enables the interrupt for the selected EIRQ. It enables interrupt both in SIUL2 and NIVC.
 * So, the callback function will be called when interrupt comes.
 *
 * @param base SIUL2 peripheral base pointer
 * @param req which interrupt request to set, 0...31
 * @param config interrupt configuration, @ref siul2_interrupt_config_t
 * @param filterCount Maximum filter count 0...15, < 0 disable filterCount.
 */
void SIUL2_EnableExtInteruptWithCallback(
    SIUL2_Type *base, uint32_t req, siul2_interrupt_config_t config, int8_t filterCount, siul2_cb_t cb);

/*!
 * @brief Disable EIRQ callback.

 * This function disables the interrupt for the selected EIRQ. It disables interrupt in SIUL2 and NIVC.
 *
 * @param base SIUL2 peripheral base pointer
 * @param req which interrupt request to set, 0...31
 */
void SIUL2_DisableExtInterruptCallback(SIUL2_Type *base, uint32_t req);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */

#endif /* FSL_GPIO_H_*/
